Copyright Jana Schaich Borg/Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)

# How to Meet and Retrieve Your Data

Watershed's intern put together a couple of sources of information that will be useful for your project. These three types of information are contained in the capstone database:
1. the current monthly rent Watershed charges for all of their client’s 244 properties, as well as the property type and geographic location of those properties. 
2. some general information about examples of short-term rental properties.  This information can be used to get a sense of what kind of nightly rental price Watershed’s client’s properties *could* be listed for, if they were converted to short-term rentals.
3. records about when those short-term rental properties were rented out, so that you can calculate their occupancy rates.

Your job is to determine how the database is organized so that you can retrieve all of the available information about Watershed’s client’s 244 properties, as well as the corresponding short-term rental information for comparable properties in the same location and of the same type.
1. Start by determining what tables the database contains, and what fields are included in each table.  
2. Then, we recommend that you make at least a rough relational schema of how the database is organized, so that you know what fields you can use to join tables. 
3. Next, make a list of the columns of data you want to retrieve in your final output.  
4. Finally, write your query to retrieve the desired data from the database.

Here are some hints about how to write your query:
* Start by joining no more than two tables.  After you have made sure the query works as written and that the output makes sense, add other tables one at a time, checking the new query and its results each time.
* Your final output should have 244 rows.  Given the limited output, the easiest way to extract the results will be to copy and paste the output from your query into Excel, although you could also extract as a .csv file and open that with Excel.  If you choose the .csv option, you might find it necessary to write your query on multiple lines when you declare it as a variable.  To do this, type a space (if you forget the space the lines will run together) and a "\" at the end of each line of your query:

```
my_data= %sql SELECT DISTINCT user_guid, state, membership_type \
FROM users \
WHERE country="US" AND state IS NOT NULL and membership_type IS NOT NULL \
ORDER BY state ASC, membership_type ASC ;

my_data.csv('my_data.csv')
```

* We recommend that you calculate the occupancy rates of the example short-term rental properties within MySQL, rather than within Excel (it will be much faster!)  To do this, only examine rental dates during 2015, and remember that there are 365 days in the year.  The final output of your calculation should be the percentage of days in 2015 that the property was occupied.  You may want to consider using a subquery for this calculation.
* Make sure that you extract information from short-term rentals <u>**_that have the same location and property type_**</u> as the 244 Watershed properties.
* If you run into trouble, use your workbooks and Teradata notes from “Managing Big Data with MySQL” to remind you how to implement different parts of your query.

<img src="https://duke.box.com/shared/static/svbdzasxe7nncnszps6ewnkr8og4798c.jpg" width="300" alt="SQL Master"/>

## Good luck and have fun!

To get started, connect to the capstone database and set the database as your default database using the following commands:

```python
%load_ext sql
%sql mysql://studentuser:studentpw@mysqlserver/capstone 
%sql USE capstone
```

### Load and connect to the database

In [1]:
%load_ext sql
%sql mysql://studentuser:studentpw@mysqlserver/capstone 
%sql USE capstone

0 rows affected.

[]

### Queries

You can add as many "cells" as you need in order to explore the database and extract the appropriate data.  For a reminder about what "cells" are, how to add them, or how to use Jupyter in general, please refer to the "How to Use Jupyter Notebooks" video at: https://www.coursera.org/learn/analytics-mysql/lecture/oxkUg/how-to-use-jupyter-notebooks.

In [ ]:
#all the queries for week 2 quiz (Verify You Have Extracted the Correct Data)

In [2]:
%%sql
SHOW tables;
#quiz 1

6 rows affected.

[('location',),
 ('property_type',),
 ('st_property_info',),
 ('st_rental_dates',),
 ('st_rental_prices',),
 ('watershed_property_info',)]

In [3]:
%%sql
SHOW columns FROM property_type;
#quiz 2

5 rows affected.

[('property_type_id', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('apt_house', 'varchar(255)', 'YES', '', None, ''),
 ('num_bedrooms', 'varchar(255)', 'YES', '', None, ''),
 ('kitchen', 'varchar(255)', 'YES', '', None, ''),
 ('shared', 'varchar(255)', 'YES', '', None, '')]

In [9]:
%%sql
SELECT * FROM watershed_property_info
LIMIT 5;

5 rows affected.

[('W1', 'L9531', 'R6', 1060),
 ('W10', 'L9533', 'R6', 1200),
 ('W100', 'L1944', 'R2', 3300),
 ('W101', 'L15257', 'R2', 1400),
 ('W102', 'L15257', 'R6', 2000)]

In [10]:
%%sql
SELECT * FROM watershed_property_info
WHERE ws_property_id = 'W106';
#quiz 3 part1 -- find the  W106 in watershed property

1 rows affected.

[('W106', 'L15260', 'R6', 1900)]

In [11]:
%%sql
SELECT * FROM property_type
WHERE property_type_id = "R6";
#quiz 3 part2 -- find the property type of W106 in property_type table

1 rows affected.

[('R6', 'apartment', '2', 'Y', 'N')]

In [12]:
%%sql
SELECT * FROM location
WHERE location_id = "L15260";
#quiz 3 part3 -- find the location of W106 in location table

1 rows affected.

[('L15260', 'Austin', 'TX', 78705)]

In [13]:
%%sql
SELECT * FROM watershed_property_info
WHERE ws_property_id = 'W24';
#quiz 4 part1 -- find the location and property type of W24 in watershed property table

1 rows affected.

[('W24', 'L4765', 'R2', 1700)]

In [19]:
%%sql
SELECT * FROM st_rental_prices
WHERE location = 'L4765' AND property_type = 'R2';
#quiz 4 part2 -- find the same property type and location information in st rental prices table

1 rows affected.

[('L4765', 'R2', 98, 430, 239)]

In [23]:
%%sql
SELECT COUNT(*) FROM property_type p JOIN watershed_property_info w
ON p.property_type_id = w.property_type
WHERE kitchen = 'Y';
#quiz 5

1 rows affected.

[(244,)]